RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_1xxxx_FWLib/library/HT32F1xxxx_Driver/inc/ht32f1xxxx_tm.h
/* Exported constants --------------------------------------------------------------------------------------*/
/** @defgroup TM_Exported_Constants TM exported constants
  * @{
  */

/** @defgroup TM_INT Definitions of TM_INT
  * @{
  */
#define TM_INT_CH0CC        0x0001  /*!< Channel 0 capture/compare interrupt                                */
#define TM_INT_CH1CC        0x0002  /*!< Channel 1 capture/compare interrupt                                */
#define TM_INT_CH2CC        0x0004  /*!< Channel 2 capture/compare interrupt                                */
#define TM_INT_CH3CC        0x0008  /*!< Channel 3 capture/compare interrupt                                */
#define TM_INT_UEV          0x0100  /*!< Update interrupt                                                   */
#define TM_INT_UEV2         0x0200  /*!< Update interrupt 2                                                 */
#define TM_INT_TEV          0x0400  /*!< Trigger interrupt                                                  */
#define TM_INT_BRKEV        0x0800  /*!< Break interrupt                                                    */
/**
  * @}
  */

/** @defgroup TM_PDMA Definitions of TM_PDMA
  * @{
  */
#define TM_PDMA_CH0CC        0x00010000  /*!< Channel 0 capture/compare PDMA request                        */
#define TM_PDMA_CH1CC        0x00020000  /*!< Channel 1 capture/compare PDMA request                        */
#define TM_PDMA_CH2CC        0x00040000  /*!< Channel 2 capture/compare PDMA request                        */
#define TM_PDMA_CH3CC        0x00080000  /*!< Channel 3 capture/compare PDMA request                        */
#define TM_PDMA_UEV          0x01000000  /*!< Update PDMA request                                           */
#define TM_PDMA_UEV2         0x02000000  /*!< Update 2 PDMA request                                         */
#define TM_PDMA_TEV          0x04000000  /*!< Trigger PDMA request                                          */
/**
  * @}
  */

/** @defgroup TM_EVENT Definitions of TM_EVENT
  * @{
  */
#define TM_EVENT_CH0CC      0x0001  /*!< Channel 0 capture/compare event                                    */
#define TM_EVENT_CH1CC      0x0002  /*!< Channel 1 capture/compare event                                    */
#define TM_EVENT_CH2CC      0x0004  /*!< Channel 2 capture/compare event                                    */
#define TM_EVENT_CH3CC      0x0008  /*!< Channel 3 capture/compare event                                    */
#define TM_EVENT_UEV        0x0100  /*!< Update event                                                       */
#define TM_EVENT_UEV2       0x0200  /*!< Update event 2                                                     */
#define TM_EVENT_TEV        0x0400  /*!< Trigger event                                                      */
#define TM_EVENT_BRKEV      0x0800  /*!< Break event                                                        */
/**
  * @}
  */

/** @defgroup TM_FLAG Definitions of TM_FLAG
  * @{
  */
#define TM_FLAG_CH0CC       0x0001  /*!< Channel 0 capture/compare flag                                     */
#define TM_FLAG_CH1CC       0x0002  /*!< Channel 1 capture/compare flag                                     */
#define TM_FLAG_CH2CC       0x0004  /*!< Channel 2 capture/compare flag                                     */
#define TM_FLAG_CH3CC       0x0008  /*!< Channel 3 capture/compare flag                                     */
#define TM_FLAG_CH0OC       0x0010  /*!< Channel 0 over capture flag                                        */
#define TM_FLAG_CH1OC       0x0020  /*!< Channel 1 over capture flag                                        */
#define TM_FLAG_CH2OC       0x0040  /*!< Channel 2 over capture flag                                        */
#define TM_FLAG_CH3OC       0x0080  /*!< Channel 3 over capture flag                                        */
#define TM_FLAG_UEV         0x0100  /*!< Update flag                                                        */
#define TM_FLAG_UEV2        0x0200  /*!< Update 2 flag                                                      */
#define TM_FLAG_TEV         0x0400  /*!< Trigger flag                                                       */
#define TM_FLAG_BRK0        0x0800  /*!< Break 0 flag                                                       */
#define TM_FLAG_BRK1        0x1000  /*!< Break 1 flag                                                       */
/**
  * @}
  */

/** @defgroup TM_Check_Parameter Check parameter
  * @{
  */

/**
 * @brief Used to check parameter of the TMx.
 */
#define IS_TM(x)            (IS_GPTM0(x) || IS_GPTM1(x) || IS_MCTM0(x) || IS_MCTM1(x) || IS_SCTM(x))
#define IS_GPTM0(x)         (x == HT_GPTM0)

#define IS_GPTM1(x)         (0)
#define IS_MCTM0(x)         (0)
#define IS_MCTM1(x)         (0)

#if !(LIBCFG_NO_GPTM1)
#undef IS_GPTM1
#define IS_GPTM1(x)         (x == HT_GPTM1)
#endif

#if !(LIBCFG_NO_MCTM0)
#undef IS_MCTM0
#define IS_MCTM0(x)         (x == HT_MCTM0)
#endif

#if !(LIBCFG_NO_MCTM1)
#undef IS_MCTM1
#define IS_MCTM1(x)         (x == HT_MCTM1)
#endif

#define IS_SCTM(x)          (IS_SCTM0(x) || IS_SCTM1(x))

#define IS_SCTM0(x)         (0)
#define IS_SCTM1(x)         (0)

#if (LIBCFG_SCTM0)
#undef IS_SCTM0
#define IS_SCTM0(x)         (x == HT_SCTM0)
#endif

#if (LIBCFG_SCTM1)
#undef IS_SCTM1
#define IS_SCTM1(x)         (x == HT_SCTM1)
#endif


/**
 * @brief Used to check parameter of the output compare mode.
 */
#define IS_TM_OM_CMP(x) (((x) == TM_OM_MATCH_NOCHANGE) || \
                         ((x) == TM_OM_MATCH_INACTIVE) || \
                         ((x) == TM_OM_MATCH_ACTIVE)   || \
                         ((x) == TM_OM_MATCH_TOGGLE)   || \
                         ((x) == TM_OM_PWM1)           || \
                         ((x) == TM_OM_PWM2))
/**
 * @brief Used to check parameter of the output mode.
 */
#define IS_TM_OM(x) (((x) == TM_OM_MATCH_NOCHANGE)  || \
                     ((x) == TM_OM_MATCH_INACTIVE)  || \
                     ((x) == TM_OM_MATCH_ACTIVE)    || \
                     ((x) == TM_OM_MATCH_TOGGLE)    || \
                     ((x) == TM_OM_PWM1)            || \
                     ((x) == TM_OM_PWM2)            || \
                     ((x) == TM_OM_FORCED_INACTIVE) || \
                     ((x) == TM_OM_FORCED_ACTIVE)   || \
                     ((x) == TM_OM_ASYMMETRIC_PWM1) || \
                     ((x) == TM_OM_ASYMMETRIC_PWM2))
/**
 * @brief Used to check parameter of the channel.
 */
#define IS_TM_CH(x) (((x) == TM_CH_0) || ((x) == TM_CH_1) || \
                     ((x) == TM_CH_2) || ((x) == TM_CH_3))
/**
 * @brief Used to check parameter of the channel for PWM input function.
 */
#define IS_TM_CH_PWMI(x) (((x) == TM_CH_0) || ((x) == TM_CH_1))
/**
 * @brief Used to check parameter of the clock divider.
 */
#define IS_TM_CKDIV(x)  ((x == TM_CKDIV_OFF) || \
                           (x == TM_CKDIV_2) || \
                           (x == TM_CKDIV_4))
/**
 * @brief Used to check parameter of the counter mode.
 */
#define IS_TM_CNT_MODE(x)   ((x == TM_CNT_MODE_UP)  ||  \
                             (x == TM_CNT_MODE_CA1) || \
                             (x == TM_CNT_MODE_CA2) || \
                             (x == TM_CNT_MODE_CA3) || \
                             (x == TM_CNT_MODE_DOWN))
/**
 * @brief Used to check parameter of the channel polarity.
 */
#define IS_TM_CHP(x)    ((x == TM_CHP_NONINVERTED) || (x == TM_CHP_INVERTED))
/**
 * @brief Used to check parameter of the channel control.
 */
#define IS_TM_CHCTL(x)  ((x == TM_CHCTL_DISABLE) || (x == TM_CHCTL_ENABLE))
/**
 * @brief Used to check parameter of the channel capture / compare PDMA selection.
 */
#define IS_TM_CHCCDS(x) ((x == TM_CHCCDS_CHCCEV) || (x == TM_CHCCDS_UEV))
/**
 * @brief Used to check parameter of the channel input selection.
 */
#define IS_TM_CHCCS(x)  ((x == TM_CHCCS_DIRECT)   || \
                         (x == TM_CHCCS_INDIRECT) || \
                         (x == TM_CHCCS_TRCED))
/**
 * @brief Used to check parameter of the channel capture prescaler.
 */
#define IS_TM_CHPSC(x)  ((x == TM_CHPSC_OFF) || \
                         (x == TM_CHPSC_2)   || \
                         (x == TM_CHPSC_4)   || \
                         (x == TM_CHPSC_8))
/**
 * @brief Used to check parameter of the ETI prescaler.
 */
#define IS_TM_ETIPSC(x) ((x == TM_ETIPSC_OFF) || \
                         (x == TM_ETIPSC_2)   || \
                         (x == TM_ETIPSC_4)   || \
                         (x == TM_ETIPSC_8))
/**
 * @brief Used to check parameter of the TM interrupt.
 */
#define IS_TM_INT(x) (((x & 0xFFFFF0F0) == 0x0) && (x != 0))
/**
 * @brief Used to check parameter of the TM PDMA request.
 */
#define IS_TM_PDMA(x) (((x & 0xF8F0FFFF) == 0x0) && (x != 0))
/**
 * @brief Used to check parameter of the TM interrupt for \ref TM_GetIntStatus function.
 */
#define IS_TM_GET_INT(x)  ((x == TM_INT_CH0CC) || \
                           (x == TM_INT_CH1CC) || \
                           (x == TM_INT_CH2CC) || \
                           (x == TM_INT_CH3CC) || \
                           (x == TM_INT_UEV)   || \
                           (x == TM_INT_UEV2)  || \
                           (x == TM_INT_TEV)   || \
                           (x == TM_INT_BRKEV))
/**
 * @brief Used to check parameter of the TM STI selection.
 */
#define IS_TM_TRSEL(x)     ((x == TM_TRSEL_UEVG)   || \
                            (x == TM_TRSEL_TI0S0)  || \
                            (x == TM_TRSEL_TI1S1)  || \
                            (x == TM_TRSEL_ETIF)   || \
                            (x == TM_TRSEL_TI0BED) || \
                            (x == TM_TRSEL_ITI0)   || \
                            (x == TM_TRSEL_ITI1)   || \
                            (x == TM_TRSEL_ITI2))
/**
 * @brief Used to check parameter of the ITI.
 */
#define IS_TM_ITI(x)  ((x == TM_TRSEL_ITI0) || (x == TM_TRSEL_ITI1) || (x == TM_TRSEL_ITI2))
/**
 * @brief Used to check parameter of the TM_TRSEL for \ref TM_ChExternalClockConfig function.
 */
#define IS_TM_TRSEL_CH(x)  ((x == TM_TRSEL_TI0S0) || (x == TM_TRSEL_TI1S1) || \
                              (x == TM_TRSEL_TI0BED))
/**
 * @brief Used to check parameter of the TM ETI polarity.
 */
#define IS_TM_ETIPOL(x) ((x == TM_ETIPOL_NONINVERTED) || (x == TM_ETIPOL_INVERTED))
/**
 * @brief Used to check parameter of the TM prescaler reload time.
 */
#define IS_TM_PSC_RLD(x) ((x == TM_PSC_RLD_UPDATE) || (x == TM_PSC_RLD_IMMEDIATE))
/**
 * @brief Used to check parameter of the forced action.
 */
#define IS_TM_OM_FORCED(x) ((x == TM_OM_FORCED_ACTIVE) || (x == TM_OM_FORCED_INACTIVE))
/**
 * @brief Used to check parameter of the decoder mode.
 */
#define IS_TM_SMSEL_DECODER(x)  ((x == TM_SMSEL_DECODER1) || (x == TM_SMSEL_DECODER2) || \
                                   (x == TM_SMSEL_DECODER3))
/**
 * @brief Used to check parameter of the event.
 */
#define IS_TM_EVENT(x)  (((x & 0xFFFFF0F0) == 0x0000) && (x != 0x0000))
/**
 * @brief Used to check parameter of the TM master mode selection.
 */
#define IS_TM_MMSEL(x)  (((x) == TM_MMSEL_RESET)   || \
                         ((x) == TM_MMSEL_ENABLE)  || \
                         ((x) == TM_MMSEL_UPDATE)  || \
                         ((x) == TM_MMSEL_CH0CC)   || \
                         ((x) == TM_MMSEL_CH0OREF) || \
                         ((x) == TM_MMSEL_CH1OREF) || \
                         ((x) == TM_MMSEL_CH2OREF) || \
                         ((x) == TM_MMSEL_CH3OREF))
/**
 * @brief Used to check parameter of the TM slave mode.
 */
#define IS_TM_SLAVE_MODE(x) ((x == TM_SMSEL_RESTART) || (x == TM_SMSEL_PAUSE) || \
                               (x == TM_SMSEL_TRIGGER) || (x == TM_SMSEL_STIED))
/**
 * @brief Used to check parameter of the TM flag.
 */
#define IS_TM_FLAG(x) ((x == TM_FLAG_CH0CC) || \
                       (x == TM_FLAG_CH1CC) || \
                       (x == TM_FLAG_CH2CC) || \
                       (x == TM_FLAG_CH3CC) || \
                       (x == TM_FLAG_CH0OC) || \
                       (x == TM_FLAG_CH1OC) || \
                       (x == TM_FLAG_CH2OC) || \
                       (x == TM_FLAG_CH3OC) || \
                       (x == TM_FLAG_UEV)   || \
                       (x == TM_FLAG_UEV2)  || \
                       (x == TM_FLAG_TEV)   || \
                       (x == TM_FLAG_BRK0)  || \
                       (x == TM_FLAG_BRK1))

/**
 * @brief Used to check parameter of the TM flag for \ref TM_ClearFlag function.
 */
#define IS_TM_FLAG_CLR(x) (((x & 0xFFFFE000) == 0) && (x != 0))
/**
 * @brief Used to check value of TM digital filter.
 */
#define IS_TM_FILTER(x) (x <= 0xF)

/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------------------------------------*/
/** @defgroup TM_Exported_Functions TM exported functions
  * @{
  */
#define TM_SetCaptureCompare0(TMx, Cmp)       TM_SetCaptureCompare(TMx, TM_CH_0, Cmp)
#define TM_SetCaptureCompare1(TMx, Cmp)       TM_SetCaptureCompare(TMx, TM_CH_1, Cmp)
#define TM_SetCaptureCompare2(TMx, Cmp)       TM_SetCaptureCompare(TMx, TM_CH_2, Cmp)
#define TM_SetCaptureCompare3(TMx, Cmp)       TM_SetCaptureCompare(TMx, TM_CH_3, Cmp)

